dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEvadc_reg.h
/** \brief 3010, Trigger Control Register, Group 11 */
#define EVADC_G11_TRCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_TRCTR*)0xF0023010u)
/** Alias (User Manual Name) for EVADC_G11_TRCTR.
* To use register names with standard convension, please use EVADC_G11_TRCTR.
*/
#define EVADC_G11TRCTR (EVADC_G11_TRCTR)

/** \brief 3080, Arbitration Config. Register, Group 11 */
#define EVADC_G11_ARBCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0023080u)
/** Alias (User Manual Name) for EVADC_G11_ARBCFG.
* To use register names with standard convension, please use EVADC_G11_ARBCFG.
*/
#define EVADC_G11ARBCFG (EVADC_G11_ARBCFG)

/** \brief 3084, Arbitration Priority Register, Group 11 */
#define EVADC_G11_ARBPR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0023084u)
/** Alias (User Manual Name) for EVADC_G11_ARBPR.
* To use register names with standard convension, please use EVADC_G11_ARBPR.
*/
#define EVADC_G11ARBPR (EVADC_G11_ARBPR)

/** \brief 3088, Analog Fct. Config. Register, Group 11 */
#define EVADC_G11_ANCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0023088u)
/** Alias (User Manual Name) for EVADC_G11_ANCFG.
* To use register names with standard convension, please use EVADC_G11_ANCFG.
*/
#define EVADC_G11ANCFG (EVADC_G11_ANCFG)

/** \brief 30A0, Input Class Register 0, Group 11 */
#define EVADC_G11_ICLASS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00230A0u)
/** Alias (User Manual Name) for EVADC_G11_ICLASS0.
* To use register names with standard convension, please use EVADC_G11_ICLASS0.
*/
#define EVADC_G11ICLASS0 (EVADC_G11_ICLASS0)

/** \brief 30A4, Input Class Register 1, Group 11 */
#define EVADC_G11_ICLASS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00230A4u)
/** Alias (User Manual Name) for EVADC_G11_ICLASS1.
* To use register names with standard convension, please use EVADC_G11_ICLASS1.
*/
#define EVADC_G11ICLASS1 (EVADC_G11_ICLASS1)

/** \brief 30B0, Alias Register, Group 11 */
#define EVADC_G11_ALIAS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00230B0u)
/** Alias (User Manual Name) for EVADC_G11_ALIAS.
* To use register names with standard convension, please use EVADC_G11_ALIAS.
*/
#define EVADC_G11ALIAS (EVADC_G11_ALIAS)

/** \brief 30B8, Boundary Select Register, Group 11 */
#define EVADC_G11_BOUND /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00230B8u)
/** Alias (User Manual Name) for EVADC_G11_BOUND.
* To use register names with standard convension, please use EVADC_G11_BOUND.
*/
#define EVADC_G11BOUND (EVADC_G11_BOUND)

/** \brief 30C0, Synchronization Control Register, Group 11 */
#define EVADC_G11_SYNCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00230C0u)
/** Alias (User Manual Name) for EVADC_G11_SYNCTR.
* To use register names with standard convension, please use EVADC_G11_SYNCTR.
*/
#define EVADC_G11SYNCTR (EVADC_G11_SYNCTR)

/** \brief 3100, Queue 0 Source Contr. Register, Group 11 */
#define EVADC_G11_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023100u)
/** Alias (User Manual Name) for EVADC_G11_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q0_QCTRL.
*/
#define EVADC_G11QCTRL0 (EVADC_G11_Q0_QCTRL)

/** \brief 3104, Queue 0 Mode Register, Group 11 */
#define EVADC_G11_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023104u)
/** Alias (User Manual Name) for EVADC_G11_Q0_QMR.
* To use register names with standard convension, please use EVADC_G11_Q0_QMR.
*/
#define EVADC_G11QMR0 (EVADC_G11_Q0_QMR)

/** \brief 3108, Queue 0 Status Register, Group 11 */
#define EVADC_G11_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023108u)
/** Alias (User Manual Name) for EVADC_G11_Q0_QSR.
* To use register names with standard convension, please use EVADC_G11_Q0_QSR.
*/
#define EVADC_G11QSR0 (EVADC_G11_Q0_QSR)

/** \brief 310C, Queue 0 Register 0, Group 11 */
#define EVADC_G11_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002310Cu)
/** Alias (User Manual Name) for EVADC_G11_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q0_Q0R.
*/
#define EVADC_G11Q0R0 (EVADC_G11_Q0_Q0R)

/** \brief 3110, Queue 0 Input Register, Group 11 */
#define EVADC_G11_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023110u)
/** Alias (User Manual Name) for EVADC_G11_Q0_QINR.
* To use register names with standard convension, please use EVADC_G11_Q0_QINR.
*/
#define EVADC_G11QINR0 (EVADC_G11_Q0_QINR)

/** \brief 3114, Queue 0 Backup Register, Group 11 */
#define EVADC_G11_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0023114u)
/** Alias (User Manual Name) for EVADC_G11_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G11_Q0_QBUR.
*/
#define EVADC_G11QBUR0 (EVADC_G11_Q0_QBUR)

/** \brief 3118, Queue 0 Requ. Timer Mode Reg., Group 11 */
#define EVADC_G11_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023118u)
/** Alias (User Manual Name) for EVADC_G11_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q0_REQTM.
*/
#define EVADC_G11REQTM0 (EVADC_G11_Q0_REQTM)

/** \brief 311C, Queue 0 Requ. Timer Status Reg., Group 11 */
#define EVADC_G11_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002311Cu)
/** Alias (User Manual Name) for EVADC_G11_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q0_REQTS.
*/
#define EVADC_G11REQTS0 (EVADC_G11_Q0_REQTS)

/** \brief 3120, Queue 1 Source Contr. Register, Group 11 */
#define EVADC_G11_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023120u)
/** Alias (User Manual Name) for EVADC_G11_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q1_QCTRL.
*/
#define EVADC_G11QCTRL1 (EVADC_G11_Q1_QCTRL)

/** \brief 3124, Queue 1 Mode Register, Group 11 */
#define EVADC_G11_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023124u)
/** Alias (User Manual Name) for EVADC_G11_Q1_QMR.
* To use register names with standard convension, please use EVADC_G11_Q1_QMR.
*/
#define EVADC_G11QMR1 (EVADC_G11_Q1_QMR)

